-- MySQL dump 10.18  Distrib 10.3.27-MariaDB, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: store
-- ------------------------------------------------------
-- Server version	10.3.27-MariaDB-0+deb10u1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `category`
--

DROP TABLE IF EXISTS `category`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `category` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(40) NOT NULL,
  `description` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `category`
--

LOCK TABLES `category` WRITE;
/*!40000 ALTER TABLE `category` DISABLE KEYS */;
INSERT INTO `category` VALUES (1,'茶具',NULL),(2,'摆件',NULL),(3,'餐具',NULL),(4,'文具',NULL);
/*!40000 ALTER TABLE `category` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product`
--

DROP TABLE IF EXISTS `product`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `product` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(40) NOT NULL,
  `cid` int(11) NOT NULL,
  `images` varchar(100) DEFAULT NULL,
  `tags` varchar(50) DEFAULT NULL,
  `spec` varchar(50) DEFAULT NULL,
  `price` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=91 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product`
--

LOCK TABLES `product` WRITE;
/*!40000 ALTER TABLE `product` DISABLE KEYS */;
INSERT INTO `product` VALUES (1,'8头青花荷花莲蓬茶具',1,'1.jpg','1,4','',350),(2,'青花釉下彩荷花鳜鱼茶叶罐《和为贵》',7,'IMG_20190531_112113.jpg','1,4,5','',350),(3,'釉下彩山水茶壶',2,'IMG_20191028_111527.jpg','1,3','15*8',180),(4,'青花釉下彩山水三才杯盖碗',8,'IMG_20191028_111630.jpg','1,3','12*9',180),(5,'青花釉下彩菊花竹子花瓶《双清》',5,'IMG_20191119_100933.jpg','1,7,8','',480),(6,'青花釉下彩山水笔筒',10,'IMG_20191224_114523.jpg','1,3','',180),(7,'青花釉下彩山水笔筒',10,'IMG_20191224_114806.jpg','1,3','',180),(8,'青花釉下彩荷花茶壶',2,'IMG_20200711_102449.jpg','1,4','13*10',180),(9,'青花釉下彩菊花茶具《延年》',1,'IMG_20200711_104228.jpg','1,7','',350),(10,'青花荷花鳜鱼三才杯盖碗《和为贵》',8,'IMG_20200711_105004.jpg','1,4,5','',180),(11,'釉下彩牡丹三才杯盖碗',8,'IMG_20200711_105227.jpg','1,6','',180),(20,'青花釉下彩荷花笔洗',12,'IMG_20200722_102156.jpg|IMG_20200722_102205.jpg|IMG_20200722_102213.jpg|IMG_20200722_102226.jpg','1,4','20*9',280),(21,'青花釉下彩山水笔洗',12,'IMG_20200722_101925.jpg|IMG_20200722_102111.jpg','1,3','20*9',280),(22,'青花釉下彩竹子茶具',1,'IMG_20200712_103730.jpg','1,8','',350),(23,'青花釉下彩牡丹茶具',1,'IMG_20200712_104012.jpg','1,6','',350),(24,'青花仿古缠枝莲纹水滴花瓶',5,'1615620163488..jpg','1,11','44*9',260),(25,'青花仿古缠枝莲纹梅瓶瓶',5,'16156204323345261147962246696050.jpg','1,11','30*12',260),(26,'青花釉下彩荷花鳜鱼茶盘《和为贵》',11,'16156205701555570002148774331750.jpg','1,4,5','44*14',350),(27,'青花釉下彩山水茶盘',11,'16156208121393300305576450233575.jpg','1,3','32*18',350),(28,'青花釉下彩山水茶盘',11,'16156210230535784283841080533979.jpg','1,3','44*14',350),(29,'青花釉下彩茶盘《有余》',11,'16156212288048292159276925521525.jpg','1,13','37*12',350),(30,'青花釉下彩葡萄茶叶罐《丰硕》',7,'16156217350056234172254028819357.jpg','1,10','13*15',260),(31,'青花釉下彩菊花茶叶罐《延年》',7,'16156218956515967889692895210336.jpg','1,7','13*13',260),(32,'青花釉下彩山水茶叶罐',7,'16156221551536955367881944481222.jpg','1,3','14*12',260),(33,'青花釉下彩兰花茶叶罐《幽香》',7,'16156223233318369092539950945211.jpg','1,9','15*10',260),(34,'青花釉下彩山水茶盘',11,'16156230479028064297605343231629.jpg','1,3','30*17',350),(35,'青花釉下彩竹子茶盘《竹报平安》',11,'16156231885401577437134120923763.jpg','1,8','32*18',350),(36,'青花釉下彩牡丹茶盘《国色》',11,'16156233736154232061508965681282.jpg','1,6','32*18',350),(37,'青花釉下彩牡丹茶盘《国色》',11,'16156235250358558697525879887003.jpg','1,6','44*14',350),(38,'青花釉下彩菊花茶盘《延年》',11,'16156236805677955751477924529248.jpg','1,7','37*12',350),(39,'青花釉下彩竹子茶盘《竹报平安》',11,'IMG_20200712_102234.jpg','1,8','30*17',350),(40,'青花釉下彩牡丹茶具',1,'IMG_20200712_104828.jpg','1,6','',350),(41,'青花釉下彩葡萄花瓶《丰硕》',5,'IMG_20200722_094233.jpg','1,10','',180),(42,'青花釉下彩竹子茶叶罐',7,'IMG_20200722_095014.jpg','1,8','',260),(43,'青花釉下彩荷花鳜鱼茶叶罐',7,'IMG_20200722_095112.jpg','1,4,5','',260),(44,'青花釉下彩菊花花瓶',5,'IMG_20200722_095223.jpg','1,7','',260),(45,'150件青花釉下彩梅花花瓶',5,'IMG_20200722_100116.jpg','1,12','',480),(46,'青花釉下彩金鱼笔洗《有余》',12,'IMG_20200722_100411.jpg','1,13','',180),(47,'150件青花釉下彩荷花鳜鱼花瓶《和为贵》',5,'IMG_20200722_100614.jpg','1,4,5','',480),(48,'青花釉下彩山水梅瓶',5,'IMG_20200722_101212.jpg','1,3','',260),(49,'青花釉下彩山水花瓶',5,'IMG_20200722_101303.jpg','1,3','',260),(50,'青花釉下彩牡丹花瓶',5,'IMG_20200722_101721.jpg','1,6','',260),(51,'青花釉下彩竹子单杯',3,'IMG_20200918_151453.jpg|IMG_20200918_151308.jpg|IMG_20200918_151546.jpg|IMG_20200919_144829.jpg','1,8','',180),(52,'青花釉下彩牡丹单杯',3,'IMG_20200918_151401.jpg|IMG_20200918_151648.jpg|IMG_20200918_151927.jpg','1,6','',180),(53,'青花釉下彩菊花单杯',3,'IMG_20200918_151443.jpg|IMG_20200918_151842.jpg','1,7','',180),(54,'青花釉下彩兰花单杯',3,'IMG_20200918_151324.jpg','1,9','',180),(55,'青花釉下彩葡萄单杯',3,'IMG_20200918_151535.jpg','1,10','',180),(56,'青花釉下彩山水单杯',3,'IMG_20200918_151633.jpg','1,3','',180),(57,'青花釉下彩有余单杯',3,'IMG_20200918_151755.jpg','1,13','',180),(58,'青花釉下彩虾趣单杯',3,'IMG_20200918_151829.jpg','1,14','',180),(59,'青花釉下彩荷花单杯',3,'IMG_20200918_151917.jpg','1,4','',180),(60,'青花釉下彩梅花单杯',3,'IMG_20200918_152001.jpg','1,12','',180),(61,'青花釉下彩竹子茶盘《知竹》',11,'16164905565202469630731132679629.jpg','1,8','38*19',350),(62,'青花釉下彩兰花茶盘《绝尘》',11,'16164907468216124520172806930685.jpg','1,9','31*19',350),(63,'釉下彩鲤鱼花瓶《有余》',5,'16164910176422140758967263491324.jpg','1,13','30*14',350),(64,'青花釉下彩梅花花瓶《清香》',5,'16164911967962870984820822073633.jpg','1,12','30*14',280),(65,'青花釉下彩牡丹主人杯',4,'16164916092581561862221126311222.jpg','1,6','7*7',180),(66,'青花釉下彩山水主人杯',4,'16164917465991151787139281139622.jpg','1,3','7*7',180),(67,'青花釉下彩菊花花瓶',5,'16164920298414368583370521532410.jpg','1,7','23*9',180),(68,'青花釉下彩金鱼花瓶',5,'IMG_20210323_173610.jpg|IMG_20210323_173602.jpg','1,13','24*7',180),(69,'青花釉下彩金鱼花瓶',5,'16164923474785671102209200003651.jpg','1,13','19*9',180),(70,'青花釉下彩竹子花瓶',5,'1616492490471707318597475342145.jpg','1,8','24*9',180),(71,'青花釉下彩葡萄茶盘《丰硕》',11,'16184767312261078508486720651184.jpg','1,10','38*20',350),(72,'青花釉下彩梅花茶盘《清香》',11,'16184768731078118961008846466973.jpg','1,12','38*20',350),(73,'8头釉下彩荷花茶具',1,'16184772010284355034983614979157.jpg','1,4','',350),(74,'8头釉下彩兰花茶具',1,'16184773898395420194566224741043.jpg','1,9','',350),(75,'青花釉下彩荷花茶叶罐',7,'16192538685662489135840080707600.jpg','1,4','23*16',480),(76,'青花釉下彩牡丹花瓶',5,'16192540837113331296316813517923.jpg','1,6','46*23',680),(77,'青花釉下彩牡丹鲤鱼花瓶',5,'16192542529985211671797951097905.jpg','1,5,6','43*15',680),(78,'青花釉下彩兰花花瓶《绝尘》',5,'16192545953638642773019881108823.jpg','1,9','36*17',380),(79,'青花釉下彩牡丹鳜鱼花瓶',5,'16192547431906958096412795749270.jpg','1,4,5','25*27',480),(80,'青花釉下彩荷花花瓶',5,'16192548930947007590213065218440.jpg','1,4','41*18',380),(81,'青花釉下彩花瓶《大吉》',5,'16192550299046611984127312588501.jpg','1','41*30',680),(82,'青花釉下彩花瓶《双喜临门》',5,'1619255189519560166658810733340.jpg','1,12','33*33',680),(83,'青花釉下彩花瓶《知竹》',5,'16192554244753289129481237019331.jpg','1,8','48*23',680),(84,'青花釉下彩花瓶《国色》',5,'1619255614069743814172712300804.jpg','1,6','47*30',680),(85,'青花釉下彩花瓶《双寿》',5,'1619255745059532684905967942598.jpg','1','51*22',680),(86,'青花釉下彩花瓶《报春》',5,'16192559136931778682078546275450.jpg','1,12','44*25',480),(87,'8头釉下彩牡丹茶具',1,'16220990114238692073193719686786.jpg','1,6','',350),(88,'8头釉下彩鳜鱼茶具',1,'16220992320182826438379036008701.jpg','1,5','',350),(89,'8头釉下彩梅花茶具',1,'16220997077175065570768125539204.jpg','1,12','',350),(90,'8头釉下彩葡萄茶具',1,'16220999111521179321628774048417.jpg','1,10','',350);
/*!40000 ALTER TABLE `product` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `sub_category`
--

DROP TABLE IF EXISTS `sub_category`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `sub_category` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(40) NOT NULL,
  `cid` int(11) NOT NULL,
  `description` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sub_category`
--

LOCK TABLES `sub_category` WRITE;
/*!40000 ALTER TABLE `sub_category` DISABLE KEYS */;
INSERT INTO `sub_category` VALUES (1,'套装',1,NULL),(2,'茶壶',1,NULL),(3,'茶杯',1,NULL),(4,'主人杯',1,NULL),(5,'花瓶',2,NULL),(6,'套装',3,NULL),(7,'茶叶罐',1,NULL),(8,'盖碗',1,NULL),(9,'套装',4,NULL),(10,'笔筒',4,NULL),(11,'茶盘',1,NULL),(12,'笔洗',4,NULL);
/*!40000 ALTER TABLE `sub_category` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tag`
--

DROP TABLE IF EXISTS `tag`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tag` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(40) NOT NULL,
  `description` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tag`
--

LOCK TABLES `tag` WRITE;
/*!40000 ALTER TABLE `tag` DISABLE KEYS */;
INSERT INTO `tag` VALUES (1,'釉下彩','釉下彩是瓷器釉彩装饰的一种，又称“窑彩”。釉下彩是陶瓷器的一种主要装饰手段，是用色料在已成型晾干的素坯（即半成品）上绘制各种纹饰，然后罩以白色透明釉或者其他浅色面釉，一次烧成。烧成后的图案被一层透明的釉膜覆盖在下边，表面光亮柔和、平滑不凸出，显得晶莹透亮。'),(2,'花鸟',NULL),(3,'山水','山水，在让中国人成为生活艺术家的同时，也成为了哲学家。《论语》中所说“子在川上曰：逝者如斯夫”，思考和追问的是生命的意义;老子说“上善若水，水善利万物而不争”，是对像水一样不争名利高尚品德的赞誉。处于新时代的我们，总喜欢把热爱山水，向往山水，走向山水，视为一种生命意识的复归，一种身处繁华都市而超越??现实、追求自由精神的理想，一种于平凡庸碌之中营造起的潇洒“心境”。“山水”成为了城市人回归自然的一个梦想。'),(4,'荷花','荷花，一直是清高的象征，花叶清秀，纯洁典雅，花香四溢，沁人心脾，自古就受到人们的喜爱和追捧，给人以精神上的享受和带来视觉上的美感。又因它清香久远，秀雅清香，寄托着人们心中洁身自爱、不同流合污的高洁追求。荷花也是莲花，寓意连年有余、和和美美、和气生财，也有祝家庭和睦、和顺等，祝夫妻关系美满，恩爱幸福的寓意。'),(5,'鳜鱼','鳜鱼谐音“贵“”余”，寓意富贵有余，另外，因为在淡水鱼中鳜鱼属于肉食性鱼类，只吃活鱼，是水族中的王者，所以鳜鱼也象征着贵族和王者风范。'),(6,'牡丹','牡丹是我国的国花，象征着气质典雅，很高贵的人。在传统的国画中最为常见的花就是牡丹花，还代表着吉祥和富贵，升华一步讲，寓意着祖国繁荣昌盛。它的花语是浓情，圆满，雍华富贵，且不同的花色所对应的花语也不同。'),(7,'菊花','菊花是自古以来受人们喜爱的一种花卉，能代表吉祥、长寿。 菊花可以在冬季开花，代表了正直不屈的精神，有顽强的生命力。 也可以代表品行高洁的人，象征着高雅纯洁，具有骨气和独特的气节。 还能代表归隐田园，表示隐居在乡野中的悠然、恬静、惬意。'),(8,'竹子','竹，有着不一般的中国传统文化含义，竹子四季常青象征着顽强的生命、青春永驻；竹子空心代表虚怀若谷的品格；其枝弯而不折，是柔中有刚的做人原则；生而有节、竹节必露则是高风亮节的象征。竹的挺拔洒脱、正直清高、清秀俊逸也是中国文人的人格追求。'),(9,'兰花','兰花的寓意是典雅、高洁、爱国、坚贞不渝。它被称为是花中君子，因其品质非常高洁。它和水仙、菊花、菖蒲被称为是花中四雅，另外，它和竹子、菊花、梅花被称为是四君子。它在很久之前是爱的吉祥物，诗歌中它代表君子，被现代人理解为高洁、美好的象征。'),(10,'葡萄','葡萄这种植物作为装饰放在家里有人丁兴旺，多子多福，是比较传统的吉祥的象征。葡萄种下一颗小小的籽，却可以结出成千上万的果实，寓意着家中一生万，子孙兴旺，也有一本万利的寓意。'),(11,'缠枝莲','传统吉祥纹样，多用于装饰瓷器。图案以莲花组成的称“缠枝莲”。缠枝纹又名“万寿藤”，寓意吉庆。因其结构连绵不断，故又具“生生不息”之意。是以一种藤蔓卷草经提炼变化而成，委婉多姿，富有动感，优美生动。'),(12,'梅花','梅花自古以来就常被人们称颂，因为它不惧寒冷，在雪中傲然绽放，呈现冬雪寒梅的盛景，令人心生敬仰。梅花是岁寒三友之一，它不惧环境，不畏冬季刺骨的寒风和霜雪，在万物凋零的季节将最美的姿态展现给世人，这是一种坚强不屈的精神，梅花的精神和气节，千百年来一直鼓舞着我们。'),(13,'金鱼','金鱼比较常见，谐音为“金玉”。因此，有着“金玉满堂”，这样富足、美好的寓意。此外，中国古代以金喻女孩，以玉喻男孩，金玉满堂还有儿女满堂、子嗣丰盈之意。'),(14,'虾','虾的寓意深刻，北方喻其为“龙”，有镇宅吉祥之意，南方喻其为“银子”，取长久富贵之意。虾对同族之物从不侵袭与伤害，和谐相处，身躯虽小，玉洁透明，淡泊名利，有高尚的品格和纯洁坦诚的胸怀，表明了洁身自好的人生寄托。此外，虾身佩玉甲皆可窥，寓意做人要坦诚透明，有顽强的生命力，有敢弄潮的意志，更有龙一样的腾飞精神，它的触角可触沙，可观云望月。');
/*!40000 ALTER TABLE `tag` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-05-27 12:01:41
